//JOBCOBAS  JOB (ACCT001),'MYTELCO ASV',CLASS=A,
//      MSGCLASS=X,TIME=60,REGION=0M
//*
//*===================================================================*
//*                            MYTELCO HR                             *
//*                                                                   *
//*  THIS JOB WOULD BE USED TO RUN THE COBOL PROGRAMS "COBASV"        *
//*                                                                   *
//*  CAUTION: THIS JCL IS FOR DEMO PURPOSE AND MAY NOT BE USED AS IS  *
//*                                                                   *
//*===================================================================*
//*
//*--------------------------------------------------------------------
//*  RUNS COBOL PROGRAM COBASV01
//*--------------------------------------------------------------------
//PGM1  EXEC PGM=COBASV01
//STEPLIB  DD  DSN=APPCAST.SOURCE.LOADLIB
//*--------------------------------------------------------------------
//*  RUNS COBOL PROGRAM COBASV02
//*--------------------------------------------------------------------
//PGM2  EXEC PGM=COBASV02
//STEPLIB  DD  DSN=APPCAST.SOURCE.LOADLIB
//*--------------------------------------------------------------------
//*  RUNS COBOL PROGRAM COBASV03
//*--------------------------------------------------------------------
//PGM3  EXEC PGM=COBASV03
//STEPLIB  DD  DSN=APPCAST.SOURCE.LOADLIB
//*--------------------------------------------------------------------
//*  RUNS COBOL PROGRAM COBASV04
//*--------------------------------------------------------------------
//PGM4  EXEC PGM=COBASV04
//STEPLIB  DD  DSN=APPCAST.SOURCE.LOADLIB
//*--------------------------------------------------------------------
//*  RUNS COBOL PROGRAM COBASV05
//*--------------------------------------------------------------------
//PGM5  EXEC PGM=COBASV05
//STEPLIB  DD  DSN=APPCAST.SOURCE.LOADLIB
//*--------------------------------------------------------------------
//*  RUNS COBOL PROGRAM COBASV06
//*--------------------------------------------------------------------
//PGM6  EXEC PGM=COBASV06
//STEPLIB  DD  DSN=APPCAST.SOURCE.LOADLIB
//*--------------------------------------------------------------------
//*  RUNS COBOL PROGRAM COBASV07
//*--------------------------------------------------------------------
//PGM7  EXEC PGM=COBASV07
//STEPLIB  DD  DSN=APPCAST.SOURCE.LOADLIB
//*--------------------------------------------------------------------
//*  RUNS COBOL PROGRAM COBASV08
//*--------------------------------------------------------------------
//PGM8  EXEC PGM=COBASV08
//STEPLIB  DD  DSN=APPCAST.SOURCE.LOADLIB
//*--------------------------------------------------------------------
//*  RUNS COBOL PROGRAM COBASV09
//*--------------------------------------------------------------------
//PGM9  EXEC PGM=COBASV09
//STEPLIB  DD  DSN=APPCAST.SOURCE.LOADLIB
//*--------------------------------------------------------------------
//*  RUNS COBOL PROGRAM COBASV10
//*--------------------------------------------------------------------
//PGM10  EXEC PGM=COBASV10
//STEPLIB  DD  DSN=APPCAST.SOURCE.LOADLIB
//*--------------------------------------------------------------------
//*  RUNS COBOL PROGRAM COBASV12
//*--------------------------------------------------------------------
//PGM12  EXEC PGM=COBASV12
//STEPLIB  DD  DSN=APPCAST.SOURCE.LOADLIB
//*--------------------------------------------------------------------
//*  RUNS COBOL PROGRAM COBASV13
//*--------------------------------------------------------------------
//PGM13  EXEC PGM=COBASV13
//STEPLIB  DD  DSN=APPCAST.SOURCE.LOADLIB
//*--------------------------------------------------------------------
//*  RUNS COBOL PROGRAM COBASV14
//*--------------------------------------------------------------------
//PGM14  EXEC PGM=COBASV14
//STEPLIB  DD  DSN=APPCAST.SOURCE.LOADLIB
//*--------------------------------------------------------------------
//*  RUNS COBOL PROGRAM COBASV15
//*--------------------------------------------------------------------
//PGM15  EXEC PGM=COBASV15
//STEPLIB  DD  DSN=APPCAST.SOURCE.LOADLIB
//*--------------------------------------------------------------------
//*  RUNS COBOL PROGRAM COBASV16
//*--------------------------------------------------------------------
//PGM16  EXEC PGM=COBASV16
//STEPLIB  DD  DSN=APPCAST.SOURCE.LOADLIB
//*--------------------------------------------------------------------
//*  RUNS COBOL PROGRAM COBASV17
//*--------------------------------------------------------------------
//PGM17  EXEC PGM=COBASV17
//STEPLIB  DD  DSN=APPCAST.SOURCE.LOADLIB
//*--------------------------------------------------------------------
//*  RUNS COBOL PROGRAM COBASV18
//*--------------------------------------------------------------------
//PGM18  EXEC PGM=COBASV18
//STEPLIB  DD  DSN=APPCAST.SOURCE.LOADLIB
//*--------------------------------------------------------------------
//*  RUNS COBOL PROGRAM COBASV19
//*--------------------------------------------------------------------
//PGM19  EXEC PGM=COBASV19
//STEPLIB  DD  DSN=APPCAST.SOURCE.LOADLIB
//*--------------------------------------------------------------------
//*  RUNS COBOL PROGRAM COBASV20
//*--------------------------------------------------------------------
//PGM20  EXEC PGM=COBASV20
//STEPLIB  DD  DSN=APPCAST.SOURCE.LOADLIB
//*--------------------------------------------------------------------
//*  RUNS COBOL PROGRAM COBASV21
//*--------------------------------------------------------------------
//PGM21  EXEC PGM=COBASV21
//STEPLIB  DD  DSN=APPCAST.SOURCE.LOADLIB
//*--------------------------------------------------------------------
//*  RUNS COBOL PROGRAM COBASV23
//*--------------------------------------------------------------------
//PGM23  EXEC PGM=COBASV23
//STEPLIB  DD  DSN=APPCAST.SOURCE.LOADLIB
//CARDIN   DD DSN=MYTELCO.CARDINDATA,DISP=(,CATLG,HOLD),
//         UNIT=SYSDA,SPACE=(CYL,(5,5)),NOTIFY
//*--------------------------------------------------------------------
//*  RUNS COBOL PROGRAM COBASV24
//*--------------------------------------------------------------------
//PGM24  EXEC PGM=COBASV24
//STEPLIB  DD  DSN=APPCAST.SOURCE.LOADLIB
//CARDIN   DD DSN=MYTELCO.CARDINDATA,DISP=(,CATLG,HOLD),
//         UNIT=SYSDA,SPACE=(CYL,(5,5)),NOTIFY
//*--------------------------------------------------------------------
//*  RUNS COBOL PROGRAM COBASV25
//*--------------------------------------------------------------------
//PGM25  EXEC PGM=COBASV25
//STEPLIB  DD  DSN=APPCAST.SOURCE.LOADLIB
//CARDIN   DD DSN=MYTELCO.CARDINDATA,DISP=(,CATLG,HOLD),
//         UNIT=SYSDA,SPACE=(CYL,(5,5)),NOTIFY
//*--------------------------------------------------------------------
//*  RUNS COBOL PROGRAM COBASV26
//*--------------------------------------------------------------------
//PGM26  EXEC PGM=COBASV26
//STEPLIB  DD  DSN=APPCAST.SOURCE.LOADLIB
//CARDIN   DD DSN=MYTELCO.CARDINDATA,DISP=(,CATLG,HOLD),
//         UNIT=SYSDA,SPACE=(CYL,(5,5)),NOTIFY
//*--------------------------------------------------------------------
//*  RUNS COBOL PROGRAM COBASV27
//*--------------------------------------------------------------------
//PGM27  EXEC PGM=COBASV27
//STEPLIB  DD  DSN=APPCAST.SOURCE.LOADLIB
//CARDIN   DD DSN=MYTELCO.CARDINDATA,DISP=(,CATLG,HOLD),
//         UNIT=SYSDA,SPACE=(CYL,(5,5)),NOTIFY
//*--------------------------------------------------------------------
//*  RUNS COBOL PROGRAM COBASV28
//*--------------------------------------------------------------------
//PGM28  EXEC PGM=COBASV28
//STEPLIB  DD  DSN=APPCAST.SOURCE.LOADLIB
//CARDIN   DD DSN=MYTELCO.CARDINDATA,DISP=(,CATLG,HOLD),
//         UNIT=SYSDA,SPACE=(CYL,(5,5)),NOTIFY
//*
